irun(64): 13.10-s003: (c) Copyright 1995-2013 Cadence Design Systems, Inc.
TOOL:	irun(64)	13.10-s003: Started on Dec 10, 2015 at 20:04:38 MST
irun
	-sv
	../design/MUX25bit2X1.sv
	../design/MUX32bit2X1.sv
	../design/adder_24b.sv
	../design/boothmult.sv
	../design/interconnect.sv
	../design/Multiplier_control.sv
	../design/Adder_cntrl.sv
	../design/exceptionChecker.sv
	../design/FPU_Control.sv
	testbench.sv
	-access +rwc
	-input ncsim.tcl
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
irun: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
SOFTINCLUDE $SYSTEM_CDS_LIB_DIR/cds.lib
|
ncsim: *W,DLCVAR (/uusoc/facility/cad_common/NCSU/CDK6-F13/cdssetup/cds.lib,1): cds.lib Invalid environment variable ''.
Loading snapshot worklib.testbench:sv .................... Done
ncsim> source /uusoc/facility/cad_tools/Cadence/INCISIV-F13/tools/inca/files/ncsimrc
ncsim> database -open waves  -shm -into waves.shm -default
Created default SHM database waves
ncsim> #probe -create top -depth all -vcd -waveform
ncsim> probe -create testbench -depth all -shm -waveform
Created probe 1
ncsim> #probe -create testbench.u_monitor -depth all -shm -waveform
ncsim> #probe -create top -memories -all testbench.u_spi_slave.mem -shm -waveform
ncsim> #probe -create top -memories -all top.u_simple_spi_top.rfifo.mem top.u_simple_spi_top.wfifo.mem -shm -waveform
ncsim> #probe -create top -memories -all top.u_monitor.read_fifo top.u_monitor.write_fifo -shm -waveform
ncsim> run 
How ???                  10
How ???                  20
How ???                  20
Yes ???                 160
Yes ???                 160
How ???                 220
Yes ???                 440
Yes ???                 440
How ???                 500
Simulation complete via $finish(1) at time 570 NS + 0
./testbench.sv:69 	#200 $finish() ;
ncsim> exit
TOOL:	irun(64)	13.10-s003: Exiting on Dec 10, 2015 at 20:04:39 MST  (total: 00:00:01)
