###############################################################
#  Generated by:      Cadence Encounter 14.26-s039_1
#  OS:                Linux x86_64(Host ID lab1-5.eng.utah.edu)
#  Generated on:      Thu Dec 17 18:52:41 2015
#  Design:            FPU_Control
#  Command:           saveDesign FPU_Control.enc
###############################################################
current_design FPU_Control
create_clock [get_ports {CLK}]  -name CLK -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {CLK}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {CLK}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {CLK}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {CLK}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {CLK}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {RSTn}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {RSTn}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {RSTn}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {RSTn}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {CS}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {CS}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {CS}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {CS}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN1[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN1[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN1[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN1[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[15]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[14]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[13]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[12]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[11]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[10]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[9]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[8]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[7]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[6]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[5]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[4]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[3]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIN2[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIN2[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIN2[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIN2[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DIV}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DIV}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DIV}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DIV}]
set_load -pin_load -max  0.008788  [get_ports {DACK}]
set_load -pin_load -min  0.008788  [get_ports {DACK}]
set_load -pin_load -max  0.008788  [get_ports {DR}]
set_load -pin_load -min  0.008788  [get_ports {DR}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[15]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[15]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[14]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[14]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[13]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[13]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[12]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[12]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[11]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[11]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[10]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[10]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[9]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[9]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[8]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[8]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[7]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[7]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[6]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[6]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[5]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[5]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[4]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[4]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[3]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[3]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[2]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[2]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[1]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[1]}]
set_load -pin_load -max  0.008788  [get_ports {DOUT[0]}]
set_load -pin_load -min  0.008788  [get_ports {DOUT[0]}]
set_load -pin_load -max  0.008788  [get_ports {DOV}]
set_load -pin_load -min  0.008788  [get_ports {DOV}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {DOA}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {DOA}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {DOA}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {DOA}]
set_load -pin_load -max  0.008788  [get_ports {ABUSY}]
set_load -pin_load -min  0.008788  [get_ports {ABUSY}]
set_load -pin_load -max  0.008788  [get_ports {MBUSY}]
set_load -pin_load -min  0.008788  [get_ports {MBUSY}]
set_load -pin_load -max  0.008788  [get_ports {EXC[2]}]
set_load -pin_load -min  0.008788  [get_ports {EXC[2]}]
set_load -pin_load -max  0.008788  [get_ports {EXC[1]}]
set_load -pin_load -min  0.008788  [get_ports {EXC[1]}]
set_load -pin_load -max  0.008788  [get_ports {EXC[0]}]
set_load -pin_load -min  0.008788  [get_ports {EXC[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {OPT}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {OPT}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {OPT}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {OPT}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {MODE[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {MODE[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {MODE[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {MODE[2]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {MODE[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {MODE[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {MODE[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {MODE[1]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -min [get_ports {MODE[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -min [get_ports {MODE[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -rise -max [get_ports {MODE[0]}]
set_driving_cell -lib_cell INVX1 -library Lib6710_05 -fall -max [get_ports {MODE[0]}]
set_load -pin_load -max  0.008788  [get_ports {DEBUG[4]}]
set_load -pin_load -min  0.008788  [get_ports {DEBUG[4]}]
set_load -pin_load -max  0.008788  [get_ports {DEBUG[3]}]
set_load -pin_load -min  0.008788  [get_ports {DEBUG[3]}]
set_load -pin_load -max  0.008788  [get_ports {DEBUG[2]}]
set_load -pin_load -min  0.008788  [get_ports {DEBUG[2]}]
set_load -pin_load -max  0.008788  [get_ports {DEBUG[1]}]
set_load -pin_load -min  0.008788  [get_ports {DEBUG[1]}]
set_load -pin_load -max  0.008788  [get_ports {DEBUG[0]}]
set_load -pin_load -min  0.008788  [get_ports {DEBUG[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {MODE[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {CS}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {MODE[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {MODE[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOA}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIV}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {RSTn}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {OPT}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN1[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DIN2[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {MBUSY}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[14]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[12]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[10]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DEBUG[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[9]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DEBUG[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[7]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DEBUG[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[5]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOV}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {EXC[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[15]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {ABUSY}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[13]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DACK}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[11]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DEBUG[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DEBUG[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[6]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DR}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {EXC[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {DOUT[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {CLK}] [get_ports {EXC[0]}]
